<template>
    <div class="approvals_section">
        <div class="form_block">
            <!-- <div class="form_block_title">Отметьте все верные утверждени</div> -->
            <p class="form_block_title">Отметье все верные утверждения</p>
            <div class="form_block">
                <v-checkbox v-for="(item, index) in currentData.list" :key="index" :label="item.value"
                    v-model="currentData.informationGoals" :value="item.value" hide-details>
                    fwawaf
                </v-checkbox>
            </div>
        </div>
        <v-btn block large :disabled="!isList" @click="redirect()" class="mt-10 auth_form_bth" color="primary">Продолжить
        </v-btn>
    </div>
</template>

<script>
export default {
    data() {
        return {
            currentData: {
                informationGoals: [],
                list: [
                    {
                        id: 1,
                        value: "Компания является финансовым институтом в соотвестии с законом США о налогооблажении иностранных счетов (FATCA) и/или главой 20.1"
                    },
                    {
                        id: 2,
                        value: 'Компания, выгодоприобретатель или бенецифиар компания является налоговым резидентом США'
                    },
                    {
                        id: 3,
                        value: 'Компания является хозяйственным обществом, имеющим стратегическое значение для оборонно-промышленного комплекса и безопасности РФ, либо обществом, находящийся под его прямым или косвенным контроллем, которые указаны в Федеральном законе от 27.07.2014 N 213-Ф3'
                    },
                    {
                        id: 4,
                        value: 'Компания осуществляет виды деятельности, которые могут именить стратегическое значение для оборонно промышленного комплекса и безопасноти РФ'
                    },
                    {
                        id: 5,
                        value: 'Компания не относиться к указанным в настоящем пунтке юридическим лицам'
                    }
                ]
            },
            list: [
                {
                    id: 1,
                    value: "Компания является финансовым институтом в соотвестии с законом США о налогооблажении иностранных счетов (FATCA) и/или главой 20.1"
                },
                {
                    id: 2,
                    value: 'Компания, выгодоприобретатель или бенецифиар компания является налоговым резидентом США'
                },
                {
                    id: 3,
                    value: 'Компания является хозяйственным обществом, имеющим стратегическое значение для оборонно-промышленного комплекса и безопасности РФ, либо обществом, находящийся под его прямым или косвенным контроллем, которые указаны в Федеральном законе от 27.07.2014 N 213-Ф3'
                },
                {
                    id: 4,
                    value: 'Компания осуществляет виды деятельности, которые могут именить стратегическое значение для оборонно промышленного комплекса и безопасноти РФ'
                },
                {
                    id: 5,
                    value: 'Компания не относиться к указанным в настоящем пунтке юридическим лицам'
                }
            ]
        }
    },
    methods: {
        redirect () {
         this.$router.push('/rate')
        }
    },
    computed: {
        isList() {
            if (this.currentData.informationGoals.length === this.currentData.list.length) {
                return true
            }
            return false
        }
    }
}
</script>

<style>

</style>